org/vue-inbox.org
#+DATE: <2021-03-17 Wed 16:21>
#+TITLE: Vue Inbox

** Vue Inbox

*** 声明式渲染

Vue.js 的核心是一个允许采用简洁的模板语法来声明式地将数据渲染进 DOM 的系统。

数据和 DOM 已经被建立了关联，所有东西都是响应式的。

我们不再和 HTML 直接交互了。一个 Vue 应用会将其挂载到一个 DOM 元素上，然后对其进行完全控制。那个 HTML 是我们的入口，但其余都会发生在新创建的 Vue 实例内部。

*** 处理用户输入

为了让用户和你的应用进行交互，我们可以用 =v-on= 指令添加一个事件监听器，通过它调用在 Vue 实例中定义的方法。

Vue 还提供了 =v-model= 指令，它能轻松实现表单输入和应用状态之间的双向绑定。

*** 组件化应用构建

组件系统是 Vue 的另一个重要概念，因为它是一种抽象，允许我们使用小型、独立和通常可复用的组件构建大型应用。

在 Vue 里，一个组件本质上是一个拥有预定义选项的一个 Vue 实例。

*** Vue 实例

*创建一个 Vue 实例*

每个 Vue 应用都是通过用 Vue 函数创建一个新的 Vue 实例开始的，当创建一个 Vue 实例时，你可以传入一个 *选项对象* 。

一个 Vue 应用由一个通过 =new Vue= 创建的根 Vue 实例，以及可选的嵌套的、可复用的组件树组成。

-----
*数据与方法*

当一个 Vue 实例被创建时，它将 data 对象中的所有的 property 加入到 Vue 的响应式系统中。当这些 property 的值发生改变时，视图将会产生“响应”，即匹配更新为新的值。

*值得注意的是只有当实例被创建时就已经存在于 data 中的 property 才是响应式的。

使用 =Object.freeze()= ，这会阻止修改现有的 property，也意味着响应系统无法再追踪变化。

除了数据 property，Vue 实例还暴露了一些有用的实例 property 与方法。它们都有前缀 =$= ，以便与用户定义的 property 区分开来。

*** 模板语法

在底层的实现上，Vue 将模板编译成虚拟 DOM 渲染函数。

如果你熟悉虚拟 DOM 并且偏爱 JavaScript 的原始力量，你也可以不用模板，直接写渲染 (render) 函数，使用可选的 JSX 语法。

更多关于 [[https://cn.vuejs.org/v2/guide/render-function.html][渲染函数 & JSX]] 。

数据绑定最常见的形式就是使用“Mustache”语法 (双大括号) 的文本插值。

Mustache 语法不能作用在 HTML attribute 上，遇到这种情况应该使用 =v-bind= 指令。

实际上，对于所有的数据绑定，Vue.js 都提供了完全的 JavaScript 表达式支持。这些表达式会在所属 Vue 实例的数据作用域下作为 JavaScript 被解析。

*限制就是，每个绑定都只能包含单个表达式。

一些指令能够接收一个“参数”，在指令名称之后以冒号表示。如：

#+BEGIN_SRC html -n
<a v-bind:href="url">...</a>
<a v-on:click="doSomething">...</a>
#+END_SRC

从 2.6.0 开始，可以用方括号括起来的 JavaScript 表达式作为一个指令的参数。

#+BEGIN_SRC html -n
  <!-- （动态参数） -->
  <a v-bind:[attributeName]="url"> ... </a>
#+END_SRC

动态参数预期会求出一个字符串，异常情况下值为 null。这个特殊的 null 值可以被显性地用于移除绑定。

修饰符 (modifier) 是以半角句号 =.= 指明的特殊后缀，用于指出一个指令应该以特殊方式绑定。例如， =.prevent= 修饰符告诉 v-on 指令对于触发的事件调用 =event.preventDefault()= 。

*** 计算属性

模板内的表达式非常便利，但是设计它们的初衷是用于简单运算的。在模板中放入太多的逻辑会让模板过重且难以维护。

#+BEGIN_EXPORT html
<essay>
编写代码一定要注意语义表述的简洁性和可读性。
</essay>
#+END_EXPORT

*对于任何复杂逻辑，你都应当使用计算属性。

你可以像绑定普通 property 一样在模板中绑定计算属性。计算属性的 getter 函数是没有副作用 (side effect) 的，这使它更易于测试和理解。

*计算属性缓存 vs 方法*

我们可以将同一函数定义为一个方法而不是一个计算属性。不同的是 *计算属性是基于它们的响应式依赖进行缓存的* ，只在相关响应式依赖发生改变时它们才会重新求值。相比之下，每当触发重新渲染时，调用方法将总会再次执行函数。

计算属性默认只有 getter，不过在需要时你也可以提供一个 setter 。

*计算属性 vs 侦听属性*

Vue 提供了一种更通用的方式来观察和响应 Vue 实例上的数据变动：侦听属性。虽然计算属性在大多数情况下更合适，但有时也需要一个自定义的侦听器。

！当需要在数据变化时执行异步或开销较大的操作时，这个方式（侦听属性）是最有用的。

使用 watch 选项允许我们执行异步操作 (访问一个 API)，限制我们执行该操作的频率，并在我们得到最终结果前，设置中间状态。这些都是计算属性无法做到的。

*** 绑定 HTML Class

在将 v-bind 用于 class 和 style 时，Vue.js 做了专门的增强。表达式结果的类型除了字符串之外，还可以是对象或数组。

#+BEGIN_EXPORT html
<essay>
结构化的数据总是更便于处理的。
</essay>
#+END_EXPORT

*1.对象语法*

我们可以传给 =v-bind:class= 一个对象，以动态地切换 class：

#+BEGIN_SRC html -n
  <div v-bind:class="{ active: isActive }"></div>

  <!-- 可以在对象中传入更多字段来动态切换多个 class -->
  <div
    class="static"
    v-bind:class="{ active: isActive, 'text-danger': hasError }"
  ></div>
#+END_SRC

绑定的数据对象不必内联定义在模板里：

#+BEGIN_SRC js -n
// <div v-bind:class="classObject"></div>

data: {
  classObject: {
    active: true,
    'text-danger': false
  }
}
#+END_SRC

我们也可以在这里绑定一个返回对象的计算属性。这是一个常用且强大的模式：

#+BEGIN_SRC js -n
// <div v-bind:class="classObject"></div>

data: {
  isActive: true,
  error: null
},
computed: {
  classObject: function () {
    return {
      active: this.isActive && !this.error,
      'text-danger': this.error && this.error.type === 'fatal'
    }
  }
}
#+END_SRC

-----
*2.数组语法*

我们可以把一个数组传给 v-bind:class，以应用一个 class 列表：

#+BEGIN_SRC js -n
// <div v-bind:class="[activeClass, errorClass]"></div>

data: {
  activeClass: 'active',
  errorClass: 'text-danger'
}
#+END_SRC

渲染为：

#+BEGIN_SRC html -n
<div class="active text-danger"></div>
#+END_SRC

在数组语法中也可以使用对象语法：

#+BEGIN_SRC html -n
  <!-- <div v-bind:class="[isActive ? activeClass : '', errorClass]"></div> -->
  <!-- 等价于 -->
  <div v-bind:class="[{ active: isActive }, errorClass]"></div>
#+END_SRC

-----
*3.用在组件上*

当在一个自定义组件上使用 class property 时，这些 class 将被添加到该 *组件的根元素* 上面。这个元素上已经存在的 class 不会被覆盖。

