public/vue-inbox.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2021-03-17 Wed 19:41 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Vue Inbox</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="themes/assets/rose-red.png" type="image/x-icon" />
           <link rel="stylesheet" href="themes/style.css" type="text/css"  />
</head>
<body>
<div id="content">
<h1 class="title">Vue Inbox</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga11b067">Vue Inbox</a>
<ul>
<li><a href="#org1adcc04">声明式渲染</a></li>
<li><a href="#orgcaeed6b">处理用户输入</a></li>
<li><a href="#org355f651">组件化应用构建</a></li>
<li><a href="#orga943d32">Vue 实例</a></li>
<li><a href="#org70ad77f">模板语法</a></li>
<li><a href="#orga8d0063">计算属性</a></li>
<li><a href="#org1e6f55c">绑定 HTML Class</a></li>
<li><a href="#org75b509c">绑定内联样式</a></li>
<li><a href="#org42bc803">条件渲染和列表渲染</a></li>
<li><a href="#org5ec4c00">事件处理</a></li>
<li><a href="#orga352bf7">表单输入绑定</a></li>
<li><a href="#org10cfeb2">组件基础</a></li>
</ul>
</li>
<li><a href="#orgcd455de">深入了解组件</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga11b067" class="outline-2">
<h2 id="orga11b067">Vue Inbox</h2>
<div class="outline-text-2" id="text-orga11b067">
</div>
<div id="outline-container-org1adcc04" class="outline-3">
<h3 id="org1adcc04">声明式渲染</h3>
<div class="outline-text-3" id="text-org1adcc04">
<p>
Vue.js 的核心是一个允许采用简洁的模板语法来声明式地将数据渲染进 DOM 的系统。
</p>

<p>
数据和 DOM 已经被建立了关联，所有东西都是响应式的。
</p>

<p>
我们不再和 HTML 直接交互了。一个 Vue 应用会将其挂载到一个 DOM 元素上，然后对其进行完全控制。那个 HTML 是我们的入口，但其余都会发生在新创建的 Vue 实例内部。
</p>
</div>
</div>

<div id="outline-container-orgcaeed6b" class="outline-3">
<h3 id="orgcaeed6b">处理用户输入</h3>
<div class="outline-text-3" id="text-orgcaeed6b">
<p>
为了让用户和你的应用进行交互，我们可以用 <code>v-on</code> 指令添加一个事件监听器，通过它调用在 Vue 实例中定义的方法。
</p>

<p>
Vue 还提供了 <code>v-model</code> 指令，它能轻松实现表单输入和应用状态之间的双向绑定。
</p>
</div>
</div>

<div id="outline-container-org355f651" class="outline-3">
<h3 id="org355f651">组件化应用构建</h3>
<div class="outline-text-3" id="text-org355f651">
<p>
组件系统是 Vue 的另一个重要概念，因为它是一种抽象，允许我们使用小型、独立和通常可复用的组件构建大型应用。
</p>

<p>
在 Vue 里，一个组件本质上是一个拥有预定义选项的一个 Vue 实例。
</p>
</div>
</div>

<div id="outline-container-orga943d32" class="outline-3">
<h3 id="orga943d32">Vue 实例</h3>
<div class="outline-text-3" id="text-orga943d32">
<p>
<b>创建一个 Vue 实例</b>
</p>

<p>
每个 Vue 应用都是通过用 Vue 函数创建一个新的 Vue 实例开始的，当创建一个 Vue 实例时，你可以传入一个 <b>选项对象</b> 。
</p>

<p>
一个 Vue 应用由一个通过 <code>new Vue</code> 创建的根 Vue 实例，以及可选的嵌套的、可复用的组件树组成。
</p>

<hr>
<p>
<b>数据与方法</b>
</p>

<p>
当一个 Vue 实例被创建时，它将 data 对象中的所有的 property 加入到 Vue 的响应式系统中。当这些 property 的值发生改变时，视图将会产生“响应”，即匹配更新为新的值。
</p>

<p>
*值得注意的是只有当实例被创建时就已经存在于 data 中的 property 才是响应式的。
</p>

<p>
使用 <code>Object.freeze()</code> ，这会阻止修改现有的 property，也意味着响应系统无法再追踪变化。
</p>

<p>
除了数据 property，Vue 实例还暴露了一些有用的实例 property 与方法。它们都有前缀 <code>$</code> ，以便与用户定义的 property 区分开来。
</p>
</div>
</div>

<div id="outline-container-org70ad77f" class="outline-3">
<h3 id="org70ad77f">模板语法</h3>
<div class="outline-text-3" id="text-org70ad77f">
<p>
在底层的实现上，Vue 将模板编译成虚拟 DOM 渲染函数。
</p>

<p>
如果你熟悉虚拟 DOM 并且偏爱 JavaScript 的原始力量，你也可以不用模板，直接写渲染 (render) 函数，使用可选的 JSX 语法。
</p>

<p>
更多关于 <a href="https://cn.vuejs.org/v2/guide/render-function.html">渲染函数 &amp; JSX</a> 。
</p>

<p>
数据绑定最常见的形式就是使用“Mustache”语法 (双大括号) 的文本插值。
</p>

<p>
Mustache 语法不能作用在 HTML attribute 上，遇到这种情况应该使用 <code>v-bind</code> 指令。
</p>

<p>
实际上，对于所有的数据绑定，Vue.js 都提供了完全的 JavaScript 表达式支持。这些表达式会在所属 Vue 实例的数据作用域下作为 JavaScript 被解析。
</p>

<p>
*限制就是，每个绑定都只能包含单个表达式。
</p>

<p>
一些指令能够接收一个“参数”，在指令名称之后以冒号表示。如：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">a</span> <span style="color: #a626a4;">v-bind</span>:<span style="color: #6a1868;">href</span>=<span style="color: #50a14f;">"url"</span>&gt;...&lt;/<span style="color: #a626a4;">a</span>&gt;
<span class="linenr">2: </span>&lt;<span style="color: #a626a4;">a</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click</span>=<span style="color: #50a14f;">"doSomething"</span>&gt;...&lt;/<span style="color: #a626a4;">a</span>&gt;
</pre>
</div>

<p>
从 2.6.0 开始，可以用方括号括起来的 JavaScript 表达式作为一个指令的参数。
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#65288;&#21160;&#24577;&#21442;&#25968;&#65289; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">2: </span>&lt;<span style="color: #a626a4;">a</span> v-bind:[attributeName]=<span style="color: #50a14f;">"url"</span>&gt; ... &lt;/<span style="color: #a626a4;">a</span>&gt;
</pre>
</div>

<p>
动态参数预期会求出一个字符串，异常情况下值为 null。这个特殊的 null 值可以被显性地用于移除绑定。
</p>

<p>
修饰符 (modifier) 是以半角句号 <code>.</code> 指明的特殊后缀，用于指出一个指令应该以特殊方式绑定。例如， <code>.prevent</code> 修饰符告诉 v-on 指令对于触发的事件调用 <code>event.preventDefault()</code> 。
</p>
</div>
</div>

<div id="outline-container-orga8d0063" class="outline-3">
<h3 id="orga8d0063">计算属性</h3>
<div class="outline-text-3" id="text-orga8d0063">
<p>
模板内的表达式非常便利，但是设计它们的初衷是用于简单运算的。在模板中放入太多的逻辑会让模板过重且难以维护。
</p>

<essay>
编写代码一定要注意语义表述的简洁性和可读性。
</essay>

<p>
*对于任何复杂逻辑，你都应当使用计算属性。
</p>

<p>
你可以像绑定普通 property 一样在模板中绑定计算属性。计算属性的 getter 函数是没有副作用 (side effect) 的，这使它更易于测试和理解。
</p>

<p>
<b>计算属性缓存 vs 方法</b>
</p>

<p>
我们可以将同一函数定义为一个方法而不是一个计算属性。不同的是 <b>计算属性是基于它们的响应式依赖进行缓存的</b> ，只在相关响应式依赖发生改变时它们才会重新求值。相比之下，每当触发重新渲染时，调用方法将总会再次执行函数。
</p>

<p>
计算属性默认只有 getter，不过在需要时你也可以提供一个 setter 。
</p>

<p>
<b>计算属性 vs 侦听属性</b>
</p>

<p>
Vue 提供了一种更通用的方式来观察和响应 Vue 实例上的数据变动：侦听属性。虽然计算属性在大多数情况下更合适，但有时也需要一个自定义的侦听器。
</p>

<p>
！当需要在数据变化时执行异步或开销较大的操作时，这个方式（侦听属性）是最有用的。
</p>

<p>
使用 watch 选项允许我们执行异步操作 (访问一个 API)，限制我们执行该操作的频率，并在我们得到最终结果前，设置中间状态。这些都是计算属性无法做到的。
</p>
</div>
</div>

<div id="outline-container-org1e6f55c" class="outline-3">
<h3 id="org1e6f55c">绑定 HTML Class</h3>
<div class="outline-text-3" id="text-org1e6f55c">
<p>
在将 v-bind 用于 class 和 style 时，Vue.js 做了专门的增强。表达式结果的类型除了字符串之外，还可以是对象或数组。
</p>

<essay>
结构化的数据总是更便于处理的。
</essay>

<p>
<b>1.对象语法</b>
</p>

<p>
我们可以传给 <code>v-bind:class</code> 一个对象，以动态地切换 class：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">div</span> <span style="color: #a626a4;">v-bind</span>:<span style="color: #6a1868;">class</span>=<span style="color: #50a14f;">"{ active: isActive }"</span>&gt;&lt;/<span style="color: #a626a4;">div</span>&gt;
<span class="linenr">2: </span>
<span class="linenr">3: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#21487;&#20197;&#22312;&#23545;&#35937;&#20013;&#20256;&#20837;&#26356;&#22810;&#23383;&#27573;&#26469;&#21160;&#24577;&#20999;&#25442;&#22810;&#20010; class </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">4: </span>&lt;<span style="color: #a626a4;">div</span>
<span class="linenr">5: </span>  <span style="color: #6a1868;">class</span>=<span style="color: #50a14f;">"static"</span>
<span class="linenr">6: </span>  <span style="color: #a626a4;">v-bind</span>:<span style="color: #6a1868;">class</span>=<span style="color: #50a14f;">"{ active: isActive, 'text-danger': hasError }"</span>
<span class="linenr">7: </span>&gt;&lt;/<span style="color: #a626a4;">div</span>&gt;
</pre>
</div>

<p>
绑定的数据对象不必内联定义在模板里：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;div v-bind:class="classObject"&gt;&lt;/div&gt;</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span>data: <span style="color: #4078f2;">{</span>
<span class="linenr">4: </span>  classObject: <span style="color: #a626a4;">{</span>
<span class="linenr">5: </span>    active: <span style="color: #b751b6;">true</span>,
<span class="linenr">6: </span>    <span style="color: #50a14f;">'text-danger'</span>: <span style="color: #b751b6;">false</span>
<span class="linenr">7: </span>  <span style="color: #a626a4;">}</span>
<span class="linenr">8: </span><span style="color: #4078f2;">}</span>
</pre>
</div>

<p>
我们也可以在这里绑定一个返回对象的计算属性。这是一个常用且强大的模式：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;div v-bind:class="classObject"&gt;&lt;/div&gt;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>data: <span style="color: #4078f2;">{</span>
<span class="linenr"> 4: </span>  isActive: <span style="color: #b751b6;">true</span>,
<span class="linenr"> 5: </span>  error: <span style="color: #b751b6;">null</span>
<span class="linenr"> 6: </span><span style="color: #4078f2;">}</span>,
<span class="linenr"> 7: </span>computed: <span style="color: #4078f2;">{</span>
<span class="linenr"> 8: </span>  <span style="color: #a626a4;">classObject</span>: <span style="color: #e45649;">function</span> <span style="color: #a626a4;">()</span> <span style="color: #a626a4;">{</span>
<span class="linenr"> 9: </span>    <span style="color: #e45649;">return</span> <span style="color: #50a14f;">{</span>
<span class="linenr">10: </span>      active: <span style="color: #b751b6;">this</span>.isActive &amp;&amp; !<span style="color: #b751b6;">this</span>.error,
<span class="linenr">11: </span>      <span style="color: #50a14f;">'text-danger'</span>: <span style="color: #b751b6;">this</span>.error &amp;&amp; <span style="color: #b751b6;">this</span>.error.type === <span style="color: #50a14f;">'fatal'</span>
<span class="linenr">12: </span>    <span style="color: #50a14f;">}</span>
<span class="linenr">13: </span>  <span style="color: #a626a4;">}</span>
<span class="linenr">14: </span><span style="color: #4078f2;">}</span>
</pre>
</div>

<hr>
<p>
<b>2.数组语法</b>
</p>

<p>
我们可以把一个数组传给 v-bind:class，以应用一个 class 列表：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;div v-bind:class="[activeClass, errorClass]"&gt;&lt;/div&gt;</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span>data: <span style="color: #4078f2;">{</span>
<span class="linenr">4: </span>  activeClass: <span style="color: #50a14f;">'active'</span>,
<span class="linenr">5: </span>  errorClass: <span style="color: #50a14f;">'text-danger'</span>
<span class="linenr">6: </span><span style="color: #4078f2;">}</span>
</pre>
</div>

<p>
渲染为：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">div</span> <span style="color: #6a1868;">class</span>=<span style="color: #50a14f;">"active text-danger"</span>&gt;&lt;/<span style="color: #a626a4;">div</span>&gt;
</pre>
</div>

<p>
在数组语法中也可以使用对象语法：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&lt;div v-bind:class="[isActive ? activeClass : '', errorClass]"&gt;&lt;/div&gt; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">2: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#31561;&#20215;&#20110; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">3: </span>&lt;<span style="color: #a626a4;">div</span> <span style="color: #a626a4;">v-bind</span>:<span style="color: #6a1868;">class</span>=<span style="color: #50a14f;">"[{ active: isActive }, errorClass]"</span>&gt;&lt;/<span style="color: #a626a4;">div</span>&gt;
</pre>
</div>

<hr>
<p>
<b>3.用在组件上</b>
</p>

<p>
当在一个自定义组件上使用 class property 时，这些 class 将被添加到该 <b>组件的根元素</b> 上面。这个元素上已经存在的 class 不会被覆盖。
</p>
</div>
</div>
