org/vue-inbox.org
*** 绑定内联样式

*1.对象语法*

=v-bind:style= 的对象语法十分直观——看着非常像 CSS，但其实是一个 JavaScript 对象。

CSS property 名可以用驼峰式 (camelCase) 或短横线分隔 (kebab-case，记得用引号括起来) 来命名：

#+BEGIN_SRC js -n
// <div v-bind:style="{ color: activeColor, fontSize: fontSize + 'px' }"></div>

data: {
  activeColor: 'red',
  fontSize: 30
}
#+END_SRC

直接绑定到一个样式对象通常更好，这会让模板更清晰：

#+BEGIN_SRC js -n
// <div v-bind:style="styleObject"></div>

data: {
  styleObject: {
    color: 'red',
    fontSize: '13px'
  }
}
#+END_SRC

同样的，对象语法常常结合返回对象的计算属性使用。

-----
*2.数组语法*

v-bind:style 的数组语法可以将多个样式对象应用到同一个元素上：

#+BEGIN_SRC html -n
<div v-bind:style="[baseStyles, overridingStyles]"></div>
#+END_SRC

*** 条件渲染和列表渲染

Vue 会尽可能高效地渲染元素，通常会复用已有元素而不是从头开始渲染。这样也不总是符合实际需求，所以 Vue 为你提供了一种方式来表达“这两个元素是完全独立的，不要复用它们”。只需添加一个具有唯一值的 key attribute 即可。

#+BEGIN_SRC html -n
<template v-if="loginType === 'username'">
  <label>Username</label>
  <input placeholder="Enter your username" key="username-input">
</template>
<template v-else>
  <label>Email</label>
  <input placeholder="Enter your email address" key="email-input">
</template>
#+END_SRC

当 Vue 正在更新使用 v-for 渲染的元素列表时，它默认使用“就地更新”的策略。如果数据项的顺序被改变，Vue 将 *不会移动 DOM 元素来匹配数据项的顺序* ，而是就地更新每个元素，并且确保它们在每个索引位置正确渲染。

*这个默认的模式是高效的，但是只适用于不依赖子组件状态或临时 DOM 状态 (例如：表单输入值) 的列表渲染输出。

为了给 Vue 一个提示，以便它能跟踪每个节点的身份，从而重用和重新排序现有元素，你需要为每项提供一个唯一 key attribute：

#+BEGIN_SRC html -n
<div v-for="item in items" v-bind:key="item.id">
  <!-- 内容 -->
</div>
#+END_SRC

*不要使用对象或数组之类的非基本类型值作为 v-for 的 key。请用字符串或数值类型的值。

当 v-if 与 v-for 一起使用时，v-for 具有比 v-if 更高的优先级。

-----
*数组更新检测*

Vue 将被侦听的数组的变更方法进行了包裹，所以它们也将会触发视图更新。这些被包裹过的方法包括：

#+BEGIN_EXAMPLE
- push()
- pop()
- shift()
- unshift()
- splice()
- sort()
- reverse()
#+END_EXAMPLE

变更方法，顾名思义，会变更调用了这些方法的原始数组。相比之下，也有非变更方法，例如 =filter()、concat()= 和 =slice()= 。它们不会变更原始数组，而总是返回一个新数组。当使用非变更方法时，可以用新数组替换旧数组：

#+BEGIN_SRC js -n
example1.items = example1.items.filter(function (item) {
    return item.message.match(/Foo/)
})
#+END_SRC

*！由于 JavaScript 的限制，Vue 不能检测数组和对象的变化。*

-----
*显示过滤/排序后的结果*

有时，我们想要显示一个数组经过过滤或排序后的版本，而不实际变更或重置原始数据。在这种情况下，可以创建一个计算属性，来返回过滤或排序后的数组。

在计算属性不适用的情况下 (例如，在嵌套 v-for 循环中) 你可以使用一个方法：

#+BEGIN_SRC js -n
// <ul v-for="set in sets">
//  <li v-for="n in even(set)">{{ n }}</li>
// </ul>

data: {
  sets: [[ 1, 2, 3, 4, 5 ], [6, 7, 8, 9, 10]]
},
methods: {
  even: function (numbers) {
    return numbers.filter(function (number) {
      return number % 2 === 0
    })
  }
}
#+END_SRC

v-for 也可以接受整数。在这种情况下，它会把模板重复对应次数。

类似于 v-if，你也可以利用带有 v-for 的 <template> 来循环渲染一段包含多个元素的内容。

-----
*v-for 与 v-if 一同使用*

当它们处于同一节点，v-for 的优先级比 v-if 更高，这意味着 v-if 将分别重复运行于每个 v-for 循环中。当你只想为部分项渲染节点时，这种优先级的机制会十分有用。而如果你的目的是有条件地跳过循环的执行，那么可以将 v-if 置于外层元素 (或 <template>) 上。

-----
*在组件上使用 v-for*

在自定义组件上，你可以像在任何普通元素上一样使用 v-for。然而，任何数据都不会被自动传递到组件里，因为 *组件有自己独立的作用域* 。 *为了把迭代数据传递到组件里，我们要使用 prop* 。

#+BEGIN_QUOTE
不自动将 item 注入到组件里的原因是，这会使得组件与 v-for 的运作紧密耦合。 *明确组件数据的来源能够使组件在其他场合重复使用* 。
#+END_QUOTE

