public/vue-inbox.html

<div id="outline-container-org75b509c" class="outline-3">
<h3 id="org75b509c">绑定内联样式</h3>
<div class="outline-text-3" id="text-org75b509c">
<p>
<b>1.对象语法</b>
</p>

<p>
<code>v-bind:style</code> 的对象语法十分直观——看着非常像 CSS，但其实是一个 JavaScript 对象。
</p>

<p>
CSS property 名可以用驼峰式 (camelCase) 或短横线分隔 (kebab-case，记得用引号括起来) 来命名：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;div v-bind:style="{ color: activeColor, fontSize: fontSize + 'px' }"&gt;&lt;/div&gt;</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span>data: <span style="color: #4078f2;">{</span>
<span class="linenr">4: </span>  activeColor: <span style="color: #50a14f;">'red'</span>,
<span class="linenr">5: </span>  fontSize: 30
<span class="linenr">6: </span><span style="color: #4078f2;">}</span>
</pre>
</div>

<p>
直接绑定到一个样式对象通常更好，这会让模板更清晰：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;div v-bind:style="styleObject"&gt;&lt;/div&gt;</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span>data: <span style="color: #4078f2;">{</span>
<span class="linenr">4: </span>  styleObject: <span style="color: #a626a4;">{</span>
<span class="linenr">5: </span>    color: <span style="color: #50a14f;">'red'</span>,
<span class="linenr">6: </span>    fontSize: <span style="color: #50a14f;">'13px'</span>
<span class="linenr">7: </span>  <span style="color: #a626a4;">}</span>
<span class="linenr">8: </span><span style="color: #4078f2;">}</span>
</pre>
</div>

<p>
同样的，对象语法常常结合返回对象的计算属性使用。
</p>

<hr>
<p>
<b>2.数组语法</b>
</p>

<p>
v-bind:style 的数组语法可以将多个样式对象应用到同一个元素上：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">div</span> <span style="color: #a626a4;">v-bind</span>:<span style="color: #6a1868;">style</span>=<span style="color: #50a14f;">"[baseStyles, overridingStyles]"</span>&gt;&lt;/<span style="color: #a626a4;">div</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org42bc803" class="outline-3">
<h3 id="org42bc803">条件渲染和列表渲染</h3>
<div class="outline-text-3" id="text-org42bc803">
<p>
Vue 会尽可能高效地渲染元素，通常会复用已有元素而不是从头开始渲染。这样也不总是符合实际需求，所以 Vue 为你提供了一种方式来表达“这两个元素是完全独立的，不要复用它们”。只需添加一个具有唯一值的 key attribute 即可。
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">template</span> <span style="color: #6a1868;">v-if</span>=<span style="color: #50a14f;">"loginType === 'username'"</span>&gt;
<span class="linenr">2: </span>  &lt;<span style="color: #a626a4;">label</span>&gt;Username&lt;/<span style="color: #a626a4;">label</span>&gt;
<span class="linenr">3: </span>  &lt;<span style="color: #a626a4;">input</span> <span style="color: #6a1868;">placeholder</span>=<span style="color: #50a14f;">"Enter your username"</span> <span style="color: #6a1868;">key</span>=<span style="color: #50a14f;">"username-input"</span>&gt;
<span class="linenr">4: </span>&lt;/<span style="color: #a626a4;">template</span>&gt;
<span class="linenr">5: </span>&lt;<span style="color: #a626a4;">template</span> v-else&gt;
<span class="linenr">6: </span>  &lt;<span style="color: #a626a4;">label</span>&gt;Email&lt;/<span style="color: #a626a4;">label</span>&gt;
<span class="linenr">7: </span>  &lt;<span style="color: #a626a4;">input</span> <span style="color: #6a1868;">placeholder</span>=<span style="color: #50a14f;">"Enter your email address"</span> <span style="color: #6a1868;">key</span>=<span style="color: #50a14f;">"email-input"</span>&gt;
<span class="linenr">8: </span>&lt;/<span style="color: #a626a4;">template</span>&gt;
</pre>
</div>

<p>
当 Vue 正在更新使用 v-for 渲染的元素列表时，它默认使用“就地更新”的策略。如果数据项的顺序被改变，Vue 将 <b>不会移动 DOM 元素来匹配数据项的顺序</b> ，而是就地更新每个元素，并且确保它们在每个索引位置正确渲染。
</p>

<p>
*这个默认的模式是高效的，但是只适用于不依赖子组件状态或临时 DOM 状态 (例如：表单输入值) 的列表渲染输出。
</p>

<p>
为了给 Vue 一个提示，以便它能跟踪每个节点的身份，从而重用和重新排序现有元素，你需要为每项提供一个唯一 key attribute：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">div</span> <span style="color: #6a1868;">v-for</span>=<span style="color: #50a14f;">"item in items"</span> <span style="color: #a626a4;">v-bind</span>:<span style="color: #6a1868;">key</span>=<span style="color: #50a14f;">"item.id"</span>&gt;
<span class="linenr">2: </span>  <span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#20869;&#23481; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">3: </span>&lt;/<span style="color: #a626a4;">div</span>&gt;
</pre>
</div>

<p>
*不要使用对象或数组之类的非基本类型值作为 v-for 的 key。请用字符串或数值类型的值。
</p>

<p>
当 v-if 与 v-for 一起使用时，v-for 具有比 v-if 更高的优先级。
</p>

<hr>
<p>
<b>数组更新检测</b>
</p>

<p>
Vue 将被侦听的数组的变更方法进行了包裹，所以它们也将会触发视图更新。这些被包裹过的方法包括：
</p>

<pre class="example">
- push()
- pop()
- shift()
- unshift()
- splice()
- sort()
- reverse()
</pre>

<p>
变更方法，顾名思义，会变更调用了这些方法的原始数组。相比之下，也有非变更方法，例如 <code>filter()、concat()</code> 和 <code>slice()</code> 。它们不会变更原始数组，而总是返回一个新数组。当使用非变更方法时，可以用新数组替换旧数组：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>example1.items = example1.items.filter<span style="color: #4078f2;">(</span><span style="color: #e45649;">function</span> <span style="color: #a626a4;">(</span><span style="color: #6a1868;">item</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
<span class="linenr">2: </span>    <span style="color: #e45649;">return</span> item.message.match<span style="color: #50a14f;">(</span><span style="color: #50a14f;">/Foo/</span><span style="color: #50a14f;">)</span>
<span class="linenr">3: </span><span style="color: #a626a4;">}</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
<b>！由于 JavaScript 的限制，Vue 不能检测数组和对象的变化。</b>
</p>

<hr>
<p>
<b>显示过滤/排序后的结果</b>
</p>

<p>
有时，我们想要显示一个数组经过过滤或排序后的版本，而不实际变更或重置原始数据。在这种情况下，可以创建一个计算属性，来返回过滤或排序后的数组。
</p>

<p>
在计算属性不适用的情况下 (例如，在嵌套 v-for 循环中) 你可以使用一个方法：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;ul v-for="set in sets"&gt;</span>
<span class="linenr"> 2: </span><span style="color: #9ca0a4;">//  </span><span style="color: #9ca0a4;">&lt;li v-for="n in even(set)"&gt;{{ n }}&lt;/li&gt;</span>
<span class="linenr"> 3: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;/ul&gt;</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>data: <span style="color: #4078f2;">{</span>
<span class="linenr"> 6: </span>  sets: <span style="color: #a626a4;">[</span><span style="color: #50a14f;">[</span> 1, 2, 3, 4, 5 <span style="color: #50a14f;">]</span>, <span style="color: #50a14f;">[</span>6, 7, 8, 9, 10<span style="color: #50a14f;">]</span><span style="color: #a626a4;">]</span>
<span class="linenr"> 7: </span><span style="color: #4078f2;">}</span>,
<span class="linenr"> 8: </span>methods: <span style="color: #4078f2;">{</span>
<span class="linenr"> 9: </span>  <span style="color: #a626a4;">even</span>: <span style="color: #e45649;">function</span> <span style="color: #a626a4;">(</span><span style="color: #6a1868;">numbers</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
<span class="linenr">10: </span>    <span style="color: #e45649;">return</span> numbers.filter<span style="color: #50a14f;">(</span><span style="color: #e45649;">function</span> <span style="color: #da8548;">(</span><span style="color: #6a1868;">number</span><span style="color: #da8548;">)</span> <span style="color: #da8548;">{</span>
<span class="linenr">11: </span>      <span style="color: #e45649;">return</span> number % 2 === 0
<span class="linenr">12: </span>    <span style="color: #da8548;">}</span><span style="color: #50a14f;">)</span>
<span class="linenr">13: </span>  <span style="color: #a626a4;">}</span>
<span class="linenr">14: </span><span style="color: #4078f2;">}</span>
</pre>
</div>

<p>
v-for 也可以接受整数。在这种情况下，它会把模板重复对应次数。
</p>

<p>
类似于 v-if，你也可以利用带有 v-for 的 &lt;template&gt; 来循环渲染一段包含多个元素的内容。
</p>

<hr>
<p>
<b>v-for 与 v-if 一同使用</b>
</p>

<p>
当它们处于同一节点，v-for 的优先级比 v-if 更高，这意味着 v-if 将分别重复运行于每个 v-for 循环中。当你只想为部分项渲染节点时，这种优先级的机制会十分有用。而如果你的目的是有条件地跳过循环的执行，那么可以将 v-if 置于外层元素 (或 &lt;template&gt;) 上。
</p>

<hr>
<p>
<b>在组件上使用 v-for</b>
</p>

<p>
在自定义组件上，你可以像在任何普通元素上一样使用 v-for。然而，任何数据都不会被自动传递到组件里，因为 <b>组件有自己独立的作用域</b> 。 <b>为了把迭代数据传递到组件里，我们要使用 prop</b> 。
</p>

<blockquote>
<p>
不自动将 item 注入到组件里的原因是，这会使得组件与 v-for 的运作紧密耦合。 <b>明确组件数据的来源能够使组件在其他场合重复使用</b> 。
</p>
</blockquote>
</div>
</div>
