org/vue-inbox.org
*** 事件处理

可以用 v-on 指令监听 DOM 事件，并在触发时运行一些 JavaScript 代码。

然而许多事件处理逻辑会更为复杂，所以直接把 JavaScript 代码写在 v-on 指令中是不可行的。因此 v-on 还可以接收 *一个需要调用的方法名称* 。

除了直接绑定到一个方法，也可以在内联 JavaScript 语句中调用方法。

#+BEGIN_SRC html -n
  <button v-on:click="counter += 1">Add 1</button>

  <!-- `greet` 是在下面定义的方法名 -->
  <button v-on:click="greet">Greet</button>

 <button v-on:click="say('hi')">Say hi</button>
#+END_SRC

*有时也需要在内联语句处理器中访问原始的 DOM 事件。可以用特殊变量 =$event= 把它传入方法：*

#+BEGIN_SRC js -n
// <button v-on:click="warn('Form cannot be submitted yet.', $event)">Submit</button>

// ...
methods: {
  warn: function (message, event) {
    // 现在我们可以访问原生事件对象
    if (event) {
      event.preventDefault()
    }
    alert(message)
  }
}
#+END_SRC

-----
*事件修饰符*

在事件处理程序中调用 event.preventDefault() 或 event.stopPropagation() 是非常常见的需求。

尽管我们可以在方法中轻松实现这点，但更好的方式是： *方法只有纯粹的数据逻辑，而不是去处理 DOM 事件细节。*

为了解决这个问题，Vue.js 为 v-on 提供了事件修饰符。之前提过，修饰符是由点开头的指令后缀来表示的。

#+BEGIN_EXAMPLE
- .stop
- .prevent
- .capture
- .self
- .once
- .passive
#+END_EXAMPLE

#+BEGIN_SRC html -n
  <!-- 阻止单击事件继续传播 -->
  <a v-on:click.stop="doThis"></a>

  <!-- 提交事件不再重载页面 -->
  <form v-on:submit.prevent="onSubmit"></form>

  <!-- 修饰符可以串联 -->
  <a v-on:click.stop.prevent="doThat"></a>

  <!-- 只有修饰符 -->
  <form v-on:submit.prevent></form>

  <!-- 添加事件监听器时使用事件捕获模式 -->
  <!-- 即内部元素触发的事件先在此处理，然后才交由内部元素进行处理 -->
  <div v-on:click.capture="doThis">...</div>

  <!-- 只当在 event.target 是当前元素自身时触发处理函数 -->
  <!-- 即事件不是从内部元素触发的 -->
  <div v-on:click.self="doThat">...</div>

  <!-- 点击事件将只会触发一次 -->
  <a v-on:click.once="doThis"></a>

  <!-- Vue 还对应 addEventListener 中的 passive 选项提供了 .passive 修饰符 -->
  <!-- 滚动事件的默认行为 (即滚动行为) 将会立即触发 -->
  <!-- 而不会等待 `onScroll` 完成  -->
  <!-- 这其中包含 `event.preventDefault()` 的情况 -->
  <div v-on:scroll.passive="onScroll">...</div>
#+END_SRC

#+BEGIN_QUOTE
使用修饰符时，顺序很重要；相应的代码会以同样的顺序产生。因此，用 =v-on:click.prevent.self= 会阻止所有的点击，而 =v-on:click.self.prevent= 只会阻止对元素自身的点击。
#+END_QUOTE

*** 表单输入绑定

你可以用 v-model 指令在表单 =<input>、<textarea>= 及 =<select>= 元素上创建双向数据绑定。

它会根据控件类型自动选取正确的方法来更新元素。尽管有些神奇，但 v-model 本质上不过是语法糖。 *它负责监听用户的输入事件以更新数据* ，并对一些极端场景进行一些特殊处理。

#+BEGIN_QUOTE
v-model 会忽略所有表单元素的 =value、checked、selected= attribute 的初始值而总是将 Vue 实例的数据作为数据来源。你应该通过 JavaScript 在组件的 data 选项中声明初始值。
#+END_QUOTE

v-model 在内部为不同的输入元素使用不同的 property 并抛出不同的事件：
- text 和 textarea 元素使用 =value= property 和 =input= 事件；
- checkbox 和 radio 使用 =checked= property 和 =change= 事件；
- select 字段将 =value= 作为 prop 并将 =change= 作为事件。

#+BEGIN_QUOTE
对于需要使用输入法 (如中文、日文、韩文等) 的语言，你会发现 v-model 不会在输入法组合文字过程中得到更新。如果你也想处理这个过程，请使用 input 事件。
#+END_QUOTE

