public/vue-inbox.html

<div id="outline-container-org5ec4c00" class="outline-3">
<h3 id="org5ec4c00">事件处理</h3>
<div class="outline-text-3" id="text-org5ec4c00">
<p>
可以用 v-on 指令监听 DOM 事件，并在触发时运行一些 JavaScript 代码。
</p>

<p>
然而许多事件处理逻辑会更为复杂，所以直接把 JavaScript 代码写在 v-on 指令中是不可行的。因此 v-on 还可以接收 <b>一个需要调用的方法名称</b> 。
</p>

<p>
除了直接绑定到一个方法，也可以在内联 JavaScript 语句中调用方法。
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span> &lt;<span style="color: #a626a4;">button</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click</span>=<span style="color: #50a14f;">"counter += 1"</span>&gt;Add 1&lt;/<span style="color: #a626a4;">button</span>&gt;
<span class="linenr">2: </span>
<span class="linenr">3: </span> <span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">`greet` &#26159;&#22312;&#19979;&#38754;&#23450;&#20041;&#30340;&#26041;&#27861;&#21517; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">4: </span> &lt;<span style="color: #a626a4;">button</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click</span>=<span style="color: #50a14f;">"greet"</span>&gt;Greet&lt;/<span style="color: #a626a4;">button</span>&gt;
<span class="linenr">5: </span>
<span class="linenr">6: </span>&lt;<span style="color: #a626a4;">button</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click</span>=<span style="color: #50a14f;">"say('hi')"</span>&gt;Say hi&lt;/<span style="color: #a626a4;">button</span>&gt;
</pre>
</div>

<p>
<b>有时也需要在内联语句处理器中访问原始的 DOM 事件。可以用特殊变量 <code>$event</code> 把它传入方法：</b>
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;button v-on:click="warn('Form cannot be submitted yet.', $event)"&gt;Submit&lt;/button&gt;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">...</span>
<span class="linenr"> 4: </span>methods: <span style="color: #4078f2;">{</span>
<span class="linenr"> 5: </span>  <span style="color: #a626a4;">warn</span>: <span style="color: #e45649;">function</span> <span style="color: #a626a4;">(</span><span style="color: #6a1868;">message</span>, <span style="color: #6a1868;">event</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
<span class="linenr"> 6: </span>    <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&#29616;&#22312;&#25105;&#20204;&#21487;&#20197;&#35775;&#38382;&#21407;&#29983;&#20107;&#20214;&#23545;&#35937;</span>
<span class="linenr"> 7: </span>    <span style="color: #e45649;">if</span> <span style="color: #50a14f;">(</span>event<span style="color: #50a14f;">)</span> <span style="color: #50a14f;">{</span>
<span class="linenr"> 8: </span>      event.preventDefault<span style="color: #da8548;">()</span>
<span class="linenr"> 9: </span>    <span style="color: #50a14f;">}</span>
<span class="linenr">10: </span>    alert<span style="color: #50a14f;">(</span>message<span style="color: #50a14f;">)</span>
<span class="linenr">11: </span>  <span style="color: #a626a4;">}</span>
<span class="linenr">12: </span><span style="color: #4078f2;">}</span>
</pre>
</div>

<hr>
<p>
<b>事件修饰符</b>
</p>

<p>
在事件处理程序中调用 event.preventDefault() 或 event.stopPropagation() 是非常常见的需求。
</p>

<p>
尽管我们可以在方法中轻松实现这点，但更好的方式是： <b>方法只有纯粹的数据逻辑，而不是去处理 DOM 事件细节。</b>
</p>

<p>
为了解决这个问题，Vue.js 为 v-on 提供了事件修饰符。之前提过，修饰符是由点开头的指令后缀来表示的。
</p>

<pre class="example">
- .stop
- .prevent
- .capture
- .self
- .once
- .passive
</pre>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr"> 1: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#38459;&#27490;&#21333;&#20987;&#20107;&#20214;&#32487;&#32493;&#20256;&#25773; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr"> 2: </span>&lt;<span style="color: #a626a4;">a</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click.stop</span>=<span style="color: #50a14f;">"doThis"</span>&gt;&lt;/<span style="color: #a626a4;">a</span>&gt;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#25552;&#20132;&#20107;&#20214;&#19981;&#20877;&#37325;&#36733;&#39029;&#38754; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr"> 5: </span>&lt;<span style="color: #a626a4;">form</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">submit.prevent</span>=<span style="color: #50a14f;">"onSubmit"</span>&gt;&lt;/<span style="color: #a626a4;">form</span>&gt;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#20462;&#39280;&#31526;&#21487;&#20197;&#20018;&#32852; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr"> 8: </span>&lt;<span style="color: #a626a4;">a</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click.stop.prevent</span>=<span style="color: #50a14f;">"doThat"</span>&gt;&lt;/<span style="color: #a626a4;">a</span>&gt;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#21482;&#26377;&#20462;&#39280;&#31526; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">11: </span>&lt;<span style="color: #a626a4;">form</span> v-on:submit.prevent&gt;&lt;/<span style="color: #a626a4;">form</span>&gt;
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#28155;&#21152;&#20107;&#20214;&#30417;&#21548;&#22120;&#26102;&#20351;&#29992;&#20107;&#20214;&#25429;&#33719;&#27169;&#24335; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">14: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#21363;&#20869;&#37096;&#20803;&#32032;&#35302;&#21457;&#30340;&#20107;&#20214;&#20808;&#22312;&#27492;&#22788;&#29702;&#65292;&#28982;&#21518;&#25165;&#20132;&#30001;&#20869;&#37096;&#20803;&#32032;&#36827;&#34892;&#22788;&#29702; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">15: </span>&lt;<span style="color: #a626a4;">div</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click.capture</span>=<span style="color: #50a14f;">"doThis"</span>&gt;...&lt;/<span style="color: #a626a4;">div</span>&gt;
<span class="linenr">16: </span>
<span class="linenr">17: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#21482;&#24403;&#22312; event.target &#26159;&#24403;&#21069;&#20803;&#32032;&#33258;&#36523;&#26102;&#35302;&#21457;&#22788;&#29702;&#20989;&#25968; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">18: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#21363;&#20107;&#20214;&#19981;&#26159;&#20174;&#20869;&#37096;&#20803;&#32032;&#35302;&#21457;&#30340; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">19: </span>&lt;<span style="color: #a626a4;">div</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click.self</span>=<span style="color: #50a14f;">"doThat"</span>&gt;...&lt;/<span style="color: #a626a4;">div</span>&gt;
<span class="linenr">20: </span>
<span class="linenr">21: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#28857;&#20987;&#20107;&#20214;&#23558;&#21482;&#20250;&#35302;&#21457;&#19968;&#27425; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">22: </span>&lt;<span style="color: #a626a4;">a</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click.once</span>=<span style="color: #50a14f;">"doThis"</span>&gt;&lt;/<span style="color: #a626a4;">a</span>&gt;
<span class="linenr">23: </span>
<span class="linenr">24: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">Vue &#36824;&#23545;&#24212; addEventListener &#20013;&#30340; passive &#36873;&#39033;&#25552;&#20379;&#20102; .passive &#20462;&#39280;&#31526; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">25: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#28378;&#21160;&#20107;&#20214;&#30340;&#40664;&#35748;&#34892;&#20026; (&#21363;&#28378;&#21160;&#34892;&#20026;) &#23558;&#20250;&#31435;&#21363;&#35302;&#21457; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">26: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#32780;&#19981;&#20250;&#31561;&#24453; `onScroll` &#23436;&#25104;  </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">27: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#36825;&#20854;&#20013;&#21253;&#21547; `event.preventDefault()` &#30340;&#24773;&#20917; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">28: </span>&lt;<span style="color: #a626a4;">div</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">scroll.passive</span>=<span style="color: #50a14f;">"onScroll"</span>&gt;...&lt;/<span style="color: #a626a4;">div</span>&gt;
</pre>
</div>

<blockquote>
<p>
使用修饰符时，顺序很重要；相应的代码会以同样的顺序产生。因此，用 <code>v-on:click.prevent.self</code> 会阻止所有的点击，而 <code>v-on:click.self.prevent</code> 只会阻止对元素自身的点击。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orga352bf7" class="outline-3">
<h3 id="orga352bf7">表单输入绑定</h3>
<div class="outline-text-3" id="text-orga352bf7">
<p>
你可以用 v-model 指令在表单 <code>&lt;input&gt;、&lt;textarea&gt;</code> 及 <code>&lt;select&gt;</code> 元素上创建双向数据绑定。
</p>

<p>
它会根据控件类型自动选取正确的方法来更新元素。尽管有些神奇，但 v-model 本质上不过是语法糖。 <b>它负责监听用户的输入事件以更新数据</b> ，并对一些极端场景进行一些特殊处理。
</p>

<blockquote>
<p>
v-model 会忽略所有表单元素的 <code>value、checked、selected</code> attribute 的初始值而总是将 Vue 实例的数据作为数据来源。你应该通过 JavaScript 在组件的 data 选项中声明初始值。
</p>
</blockquote>

<p>
v-model 在内部为不同的输入元素使用不同的 property 并抛出不同的事件：
</p>
<ul class="org-ul">
<li>text 和 textarea 元素使用 <code>value</code> property 和 <code>input</code> 事件；</li>
<li>checkbox 和 radio 使用 <code>checked</code> property 和 <code>change</code> 事件；</li>
<li>select 字段将 <code>value</code> 作为 prop 并将 <code>change</code> 作为事件。</li>
</ul>

<blockquote>
<p>
对于需要使用输入法 (如中文、日文、韩文等) 的语言，你会发现 v-model 不会在输入法组合文字过程中得到更新。如果你也想处理这个过程，请使用 input 事件。
</p>
</blockquote>
</div>
</div>
