org/vue-inbox.org
*** 组件基础

组件是可复用的 Vue 实例，且带有一个名字，它们与 new Vue 接收相同的选项，例如 =data、computed、watch、methods= 以及生命周期钩子等。

*仅有的例外是像 =el= 这样根实例特有的选项。

*一个组件的 data 选项必须是一个函数* ，因此每个实例可以维护一份被返回对象的独立的拷贝。

为了能在模板中使用，这些组件必须先注册以便 Vue 能够识别。这里有两种组件的注册类型：全局注册和局部注册。

全局注册的组件可以用在其被注册之后的任何 (通过 new Vue) 新创建的 Vue 根实例，也包括其组件树中的所有子组件的模板中。

-----
*通过 Prop 向子组件传递数据*

Prop 是你可以在组件上注册的一些自定义 attribute。当一个值传递给一个 prop attribute 的时候，它就变成了那个组件实例的一个 property。

#+BEGIN_SRC js -n
  // 全局注册 `blog-post` 组件
  Vue.component('blog-post', {
    props: ['title'],
    template: '<h3>{{ title }}</h3>'
  })

  // 一个 prop 被注册之后，你就可以像这样把数据作为一个自定义 attribute 传递进来
  // <blog-post title="My journey with Vue"></blog-post>
  // <blog-post title="Blogging with Vue"></blog-post>
#+END_SRC

*我们能够在组件实例中访问这个值，就像访问 data 中的值一样。

一个组件默认可以拥有任意数量的 prop， *任何值* 都可以传递给任何 prop。

*！每个组件必须只有一个根元素。*

-----
*监听子组件事件*

在我们开发 =<blog-post>= 组件时，它的一些功能可能要求我们和父级组件进行沟通。例如我们可能会引入一个辅助功能来放大博文的字号，同时让页面的其它部分保持默认的字号。

Vue 实例提供了一个自定义事件的系统来解决这个问题。父级组件可以像处理 native DOM 事件一样通过 v-on 监听子组件实例的任意事件：

#+BEGIN_SRC html -n
<blog-post
  ...
  v-on:enlarge-text="postFontSize += 0.1"
></blog-post>
#+END_SRC

同时子组件可以通过调用内建的 =$emit= 方法并传入事件名称来触发一个事件：

#+BEGIN_SRC html -n
<button v-on:click="$emit('enlarge-text')">
  Enlarge text
</button>
#+END_SRC

-----
*使用事件抛出一个值*

有的时候用一个事件来抛出一个特定的值是非常有用的。

例如我们可能想让 =<blog-post>= 组件决定它的文本要放大多少。这时可以使用 =$emit= 的第二个参数来提供这个值：

#+BEGIN_SRC html -n
<button v-on:click="$emit('enlarge-text', 0.1)">
  Enlarge text
</button>
#+END_SRC

然后当在 *父级组件监听这个事件* 的时候，我们 *可以通过 =$event= 访问到被抛出的这个值* ：

#+BEGIN_SRC html -n
<blog-post
  ...
  v-on:enlarge-text="postFontSize += $event"
></blog-post>
#+END_SRC

或者，如果这个事件处理函数是 *一个方法* ，那么这个值将会 *作为第一个参数传入这个方法* ：

#+BEGIN_SRC js -n
// <blog-post
//   ...
//   v-on:enlarge-text="onEnlargeText"
// ></blog-post>

methods: {
  onEnlargeText: function (enlargeAmount) {
    this.postFontSize += enlargeAmount
  }
}
// `enlargeAmount` 就是组件抛出来的值
#+END_SRC

-----
*通过插槽分发内容*

和 HTML 元素一样，我们经常需要向一个组件传递内容，像这样：

#+BEGIN_SRC html -n
<alert-box>
  Something bad happened.
</alert-box>
#+END_SRC

幸好，Vue 自定义的 <slot> 元素让这变得非常简单：

#+BEGIN_SRC js -n
Vue.component('alert-box', {
  template: `
    <div class="demo-alert-box">
      <strong>Error!</strong>
      <slot></slot>
    </div>
  `
})
#+END_SRC

-----
*动态组件*

在不同组件之间进行动态切换是非常有用的，可以通过 Vue 的 =<component>= 元素加一个特殊的 =is= attribute 来实现，如：

#+BEGIN_SRC html -n
<!-- 组件会在 `currentTabComponent` 改变时改变 -->
<component v-bind:is="currentTabComponent"></component>
#+END_SRC

*？请留意，这个 attribute 可以用于常规 HTML 元素，但这些元素将被视为组件，这意味着所有的 attribute 都会作为 DOM attribute 被绑定。对于像 =value= 这样的 property，若想让其如预期般工作，你需要使用 =.prop= 修饰器。

有些 HTML 元素，诸如 =<ul>、<ol>、<table>= 和 =<select>= ，对于哪些元素可以出现在其内部是有严格限制的。而有些元素，诸如 =<li>、<tr>= 和 =<option>= ，只能出现在其它某些特定的元素内部。

这会导致我们使用这些有约束条件的元素时遇到一些问题。例如：

#+BEGIN_SRC html -n
<table>
  <blog-post-row></blog-post-row>
</table>
#+END_SRC

这个自定义组件 =<blog-post-row>= 会被作为无效的内容提升到外部，并导致最终渲染结果出错。幸好这个特殊的 =is= attribute 给了我们一个变通的办法：

#+BEGIN_SRC html -n
<table>
  <tr is="blog-post-row"></tr>
</table>
#+END_SRC

需要注意的是 *如果我们从以下来源使用模板的话，这条限制是不存在的：*
- 字符串 (例如： =template: '...'= )
- 单文件组件 (=.vue=)
- ~<script type="text/x-template">~

到这里，你需要了解的解析 DOM 模板时的注意事项——实际上也是 Vue 的全部必要内容，大概就是这些了。恭喜你！

** 深入了解组件
