public/vue-inbox.html

<div id="outline-container-org10cfeb2" class="outline-3">
<h3 id="org10cfeb2">组件基础</h3>
<div class="outline-text-3" id="text-org10cfeb2">
<p>
组件是可复用的 Vue 实例，且带有一个名字，它们与 new Vue 接收相同的选项，例如 <code>data、computed、watch、methods</code> 以及生命周期钩子等。
</p>

<p>
*仅有的例外是像 <code>el</code> 这样根实例特有的选项。
</p>

<p>
<b>一个组件的 data 选项必须是一个函数</b> ，因此每个实例可以维护一份被返回对象的独立的拷贝。
</p>

<p>
为了能在模板中使用，这些组件必须先注册以便 Vue 能够识别。这里有两种组件的注册类型：全局注册和局部注册。
</p>

<p>
全局注册的组件可以用在其被注册之后的任何 (通过 new Vue) 新创建的 Vue 根实例，也包括其组件树中的所有子组件的模板中。
</p>

<hr>
<p>
<b>通过 Prop 向子组件传递数据</b>
</p>

<p>
Prop 是你可以在组件上注册的一些自定义 attribute。当一个值传递给一个 prop attribute 的时候，它就变成了那个组件实例的一个 property。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&#20840;&#23616;&#27880;&#20876; `blog-post` &#32452;&#20214;</span>
<span class="linenr">2: </span>Vue.component<span style="color: #4078f2;">(</span><span style="color: #50a14f;">'blog-post'</span>, <span style="color: #a626a4;">{</span>
<span class="linenr">3: </span>  props: <span style="color: #50a14f;">[</span><span style="color: #50a14f;">'title'</span><span style="color: #50a14f;">]</span>,
<span class="linenr">4: </span>  template: <span style="color: #50a14f;">'&lt;h3&gt;{{ title }}&lt;/h3&gt;'</span>
<span class="linenr">5: </span><span style="color: #a626a4;">}</span><span style="color: #4078f2;">)</span>
<span class="linenr">6: </span>
<span class="linenr">7: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&#19968;&#20010; prop &#34987;&#27880;&#20876;&#20043;&#21518;&#65292;&#20320;&#23601;&#21487;&#20197;&#20687;&#36825;&#26679;&#25226;&#25968;&#25454;&#20316;&#20026;&#19968;&#20010;&#33258;&#23450;&#20041; attribute &#20256;&#36882;&#36827;&#26469;</span>
<span class="linenr">8: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;blog-post title="My journey with Vue"&gt;&lt;/blog-post&gt;</span>
<span class="linenr">9: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;blog-post title="Blogging with Vue"&gt;&lt;/blog-post&gt;</span>
</pre>
</div>

<p>
*我们能够在组件实例中访问这个值，就像访问 data 中的值一样。
</p>

<p>
一个组件默认可以拥有任意数量的 prop， <b>任何值</b> 都可以传递给任何 prop。
</p>

<p>
<b>！每个组件必须只有一个根元素。</b>
</p>

<hr>
<p>
<b>监听子组件事件</b>
</p>

<p>
在我们开发 <code>&lt;blog-post&gt;</code> 组件时，它的一些功能可能要求我们和父级组件进行沟通。例如我们可能会引入一个辅助功能来放大博文的字号，同时让页面的其它部分保持默认的字号。
</p>

<p>
Vue 实例提供了一个自定义事件的系统来解决这个问题。父级组件可以像处理 native DOM 事件一样通过 v-on 监听子组件实例的任意事件：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">blog-post</span>
<span class="linenr">2: </span>  ...
<span class="linenr">3: </span>  <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">enlarge-text</span>=<span style="color: #50a14f;">"postFontSize += 0.1"</span>
<span class="linenr">4: </span>&gt;&lt;/<span style="color: #a626a4;">blog-post</span>&gt;
</pre>
</div>

<p>
同时子组件可以通过调用内建的 <code>$emit</code> 方法并传入事件名称来触发一个事件：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">button</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click</span>=<span style="color: #50a14f;">"$emit('enlarge-text')"</span>&gt;
<span class="linenr">2: </span>  Enlarge text
<span class="linenr">3: </span>&lt;/<span style="color: #a626a4;">button</span>&gt;
</pre>
</div>

<hr>
<p>
<b>使用事件抛出一个值</b>
</p>

<p>
有的时候用一个事件来抛出一个特定的值是非常有用的。
</p>

<p>
例如我们可能想让 <code>&lt;blog-post&gt;</code> 组件决定它的文本要放大多少。这时可以使用 <code>$emit</code> 的第二个参数来提供这个值：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">button</span> <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">click</span>=<span style="color: #50a14f;">"$emit('enlarge-text', 0.1)"</span>&gt;
<span class="linenr">2: </span>  Enlarge text
<span class="linenr">3: </span>&lt;/<span style="color: #a626a4;">button</span>&gt;
</pre>
</div>

<p>
然后当在 <b>父级组件监听这个事件</b> 的时候，我们 <b>可以通过 <code>$event</code> 访问到被抛出的这个值</b> ：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">blog-post</span>
<span class="linenr">2: </span>  ...
<span class="linenr">3: </span>  <span style="color: #a626a4;">v-on</span>:<span style="color: #6a1868;">enlarge-text</span>=<span style="color: #50a14f;">"postFontSize += $event"</span>
<span class="linenr">4: </span>&gt;&lt;/<span style="color: #a626a4;">blog-post</span>&gt;
</pre>
</div>

<p>
或者，如果这个事件处理函数是 <b>一个方法</b> ，那么这个值将会 <b>作为第一个参数传入这个方法</b> ：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&lt;blog-post</span>
<span class="linenr"> 2: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">...</span>
<span class="linenr"> 3: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">v-on:enlarge-text="onEnlargeText"</span>
<span class="linenr"> 4: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">&gt;&lt;/blog-post&gt;</span>
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>methods: <span style="color: #4078f2;">{</span>
<span class="linenr"> 7: </span>  <span style="color: #a626a4;">onEnlargeText</span>: <span style="color: #e45649;">function</span> <span style="color: #a626a4;">(</span><span style="color: #6a1868;">enlargeAmount</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
<span class="linenr"> 8: </span>    <span style="color: #b751b6;">this</span>.postFontSize += enlargeAmount
<span class="linenr"> 9: </span>  <span style="color: #a626a4;">}</span>
<span class="linenr">10: </span><span style="color: #4078f2;">}</span>
<span class="linenr">11: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">`enlargeAmount` &#23601;&#26159;&#32452;&#20214;&#25243;&#20986;&#26469;&#30340;&#20540;</span>
</pre>
</div>

<hr>
<p>
<b>通过插槽分发内容</b>
</p>

<p>
和 HTML 元素一样，我们经常需要向一个组件传递内容，像这样：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">alert-box</span>&gt;
<span class="linenr">2: </span>  Something bad happened.
<span class="linenr">3: </span>&lt;/<span style="color: #a626a4;">alert-box</span>&gt;
</pre>
</div>

<p>
幸好，Vue 自定义的 &lt;slot&gt; 元素让这变得非常简单：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>Vue.component<span style="color: #4078f2;">(</span><span style="color: #50a14f;">'alert-box'</span>, <span style="color: #a626a4;">{</span>
<span class="linenr">2: </span>  template: <span style="color: #50a14f;">`</span>
<span class="linenr">3: </span><span style="color: #50a14f;">    &lt;div class="demo-alert-box"&gt;</span>
<span class="linenr">4: </span><span style="color: #50a14f;">      &lt;strong&gt;Error!&lt;/strong&gt;</span>
<span class="linenr">5: </span><span style="color: #50a14f;">      &lt;slot&gt;&lt;/slot&gt;</span>
<span class="linenr">6: </span><span style="color: #50a14f;">    &lt;/div&gt;</span>
<span class="linenr">7: </span><span style="color: #50a14f;">  `</span>
<span class="linenr">8: </span><span style="color: #a626a4;">}</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<hr>
<p>
<b>动态组件</b>
</p>

<p>
在不同组件之间进行动态切换是非常有用的，可以通过 Vue 的 <code>&lt;component&gt;</code> 元素加一个特殊的 <code>is</code> attribute 来实现，如：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span><span style="color: #9ca0a4;">&lt;!-- </span><span style="color: #9ca0a4;">&#32452;&#20214;&#20250;&#22312; `currentTabComponent` &#25913;&#21464;&#26102;&#25913;&#21464; </span><span style="color: #9ca0a4;">--&gt;</span>
<span class="linenr">2: </span>&lt;<span style="color: #a626a4;">component</span> <span style="color: #a626a4;">v-bind</span>:<span style="color: #6a1868;">is</span>=<span style="color: #50a14f;">"currentTabComponent"</span>&gt;&lt;/<span style="color: #a626a4;">component</span>&gt;
</pre>
</div>

<p>
*？请留意，这个 attribute 可以用于常规 HTML 元素，但这些元素将被视为组件，这意味着所有的 attribute 都会作为 DOM attribute 被绑定。对于像 <code>value</code> 这样的 property，若想让其如预期般工作，你需要使用 <code>.prop</code> 修饰器。
</p>

<p>
有些 HTML 元素，诸如 <code>&lt;ul&gt;、&lt;ol&gt;、&lt;table&gt;</code> 和 <code>&lt;select&gt;</code> ，对于哪些元素可以出现在其内部是有严格限制的。而有些元素，诸如 <code>&lt;li&gt;、&lt;tr&gt;</code> 和 <code>&lt;option&gt;</code> ，只能出现在其它某些特定的元素内部。
</p>

<p>
这会导致我们使用这些有约束条件的元素时遇到一些问题。例如：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">table</span>&gt;
<span class="linenr">2: </span>  &lt;<span style="color: #a626a4;">blog-post-row</span>&gt;&lt;/<span style="color: #a626a4;">blog-post-row</span>&gt;
<span class="linenr">3: </span>&lt;/<span style="color: #a626a4;">table</span>&gt;
</pre>
</div>

<p>
这个自定义组件 <code>&lt;blog-post-row&gt;</code> 会被作为无效的内容提升到外部，并导致最终渲染结果出错。幸好这个特殊的 <code>is</code> attribute 给了我们一个变通的办法：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #a626a4;">table</span>&gt;
<span class="linenr">2: </span>  &lt;<span style="color: #a626a4;">tr</span> <span style="color: #6a1868;">is</span>=<span style="color: #50a14f;">"blog-post-row"</span>&gt;&lt;/<span style="color: #a626a4;">tr</span>&gt;
<span class="linenr">3: </span>&lt;/<span style="color: #a626a4;">table</span>&gt;
</pre>
</div>

<p>
需要注意的是 <b>如果我们从以下来源使用模板的话，这条限制是不存在的：</b>
</p>
<ul class="org-ul">
<li>字符串 (例如： <code>template: '...'</code> )</li>
<li>单文件组件 (<code>.vue</code>)</li>
<li><code>&lt;script type="text/x-template"&gt;</code></li>
</ul>

<p>
到这里，你需要了解的解析 DOM 模板时的注意事项——实际上也是 Vue 的全部必要内容，大概就是这些了。恭喜你！
</p>
</div>
</div>
</div>

<div id="outline-container-orgcd455de" class="outline-2">
<h2 id="orgcd455de">深入了解组件</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-03-17 Wed 16:21</p>
<p class="author">Author: Jack Liu</p>
<p class="date">Created: 2021-03-17 Wed 19:41</p>
<p class="validation"><a href="http://beian.miit.gov.cn/">豫ICP备19025929号</a></p>
</div>
</body>
</html>
